#include "hooked.hpp"
#include "prediction.hpp"
#include "player.hpp"
#include "lag_compensation.hpp"
#include "anti_aimbot.hpp"
#include "angle_resolver.hpp"
#include <chrono>
#include "visuals.hpp"
#include "prop_manager.hpp"
#include "rmenu.hpp"
#include "menu.h"
#include "weapon.hpp"
#include "movement.hpp"
#include "misc.hpp"
#include "thread/threading.h"
#include "thread/shared_mutex.h"

#include <thread>

const unsigned int FCLIENTANIM_SEQUENCE_CYCLE = 0x00000001;

void fix_local_anims() {
	auto animstate = cheat::main::local()->get_animation_state();
	if (!animstate)
		return;

	const auto local = cheat::main::local();
	if (!cheat::game::last_cmd || !local || local->IsDead())
		return;

	animstate->abs_yaw = cheat::main::real_yaw;

	static std::array<float, 24> sent_pose_params = cheat::main::local()->m_flPoseParameter();
	static int last_tick = -1;
	static float angle = animstate->abs_yaw;

	int current_tick = cheat::main::unpred_tickcount;
	if (current_tick != cheat::main::unpred_tickcount)
		current_tick = Source::m_pGlobalVars->tickcount;

	if (last_tick != current_tick)
	{
		last_tick = current_tick;

		cheat::main::should_update_local_anims = cheat::main::local()->client_side_animation() = true;
		cheat::main::local()->LastBoneSetupFrame() = -FLT_MAX; // invalidate bone cache for proper matrix
		*(std::uint32_t*)(uintptr_t(cheat::main::local()) + 0x2690) = 0; // invalidate bone cache for proper matrix
		cheat::main::local()->update_client_anims();
		if (cheat::main::send_packet)
		{
			angle = animstate->abs_yaw;
			sent_pose_params = cheat::main::local()->m_flPoseParameter();
		}
	}
	animstate->abs_yaw = angle;
	cheat::main::should_update_local_anims = cheat::main::local()->client_side_animation() = false;
	cheat::main::local()->set_abs_angles({ 0.f, angle, 0.f });
	std::memcpy(cheat::main::local()->animation_layers_ptr(), cheat::main::local_server_anim_layers, sizeof(C_AnimationLayer) * 13);
	cheat::main::local()->m_flPoseParameter() = sent_pose_params;

	if (!Source::m_pClientState->m_iChockedCommands) {
		local->force_bone_rebuild();
		local->SetupBonesEx();
		memcpy(cheat::features::antiaimbot.last_sent_matrix, cheat::main::local()->m_CachedBoneData().Base(), cheat::main::local()->GetBoneCount() * sizeof(matrix3x4_t));

		for (int i = 0; i < 128; ++i)
			cheat::main::local_bone_origin_delta[i] = cheat::main::local()->m_vecOrigin() - cheat::features::antiaimbot.last_sent_matrix[i].GetOrigin();
	}

	//const auto cmd = cheat::game::last_cmd;
	//const auto local = cheat::main::local();
	//if (!cmd || !local || local->IsDead()) return;

	//const auto old_curtime = Source::m_pGlobalVars->curtime, old_frametime = Source::m_pGlobalVars->frametime;

	//static int old_cmd_nr = 0;
	//if (old_cmd_nr != cheat::game::last_cmd->command_number) {
	//	old_cmd_nr = cheat::game::last_cmd->command_number;

	//	Source::m_pGlobalVars->curtime = local->m_flSimulationTime(), Source::m_pGlobalVars->frametime = Source::m_pGlobalVars->interval_per_tick;

	//	local->client_side_animation() = true;

	//	cheat::main::should_update_local_anims = true;
	//	local->update_client_anims();
	//	cheat::main::should_update_local_anims = false;

	//	std::memcpy(local->animation_layers_ptr(), cheat::main::local_server_anim_layers, sizeof(C_AnimationLayer) * 13);

	//	if (!Source::m_pClientState->m_iChockedCommands) {
	//		local->m_flPoseParameter().at(6) = 0; // magic trick ;^)
	//		local->force_bone_rebuild();
	//		local->SetupBonesEx();
	//		memcpy(cheat::features::antiaimbot.last_sent_matrix, local->m_CachedBoneData().Base(), local->GetBoneCount() * sizeof(matrix3x4_t));

	//		for (int i = 0; i < 128; ++i)
	//			cheat::main::local_bone_origin_delta[i] = local->m_vecOrigin() - cheat::features::antiaimbot.last_sent_matrix[i].GetOrigin();
	//	}

	//	Source::m_pGlobalVars->curtime = old_curtime, Source::m_pGlobalVars->frametime = old_frametime;
	//}
}

class CFlashLightEffect
{
public:
	bool m_bIsOn; //0x0000 
	char pad_0x0001[0x3]; //0x0001
	int m_nEntIndex; //0x0004 
	WORD m_FlashLightHandle; //0x0008 
	char pad_0x000A[0x2]; //0x000A
	float m_flMuzzleFlashBrightness; //0x000C 
	float m_flFov; //0x0010 
	float m_flFarZ; //0x0014 
	float m_flLinearAtten; //0x0018 
	bool m_bCastsShadows; //0x001C 
	char pad_0x001D[0x3]; //0x001D
	float m_flCurrentPullBackDist; //0x0020 
	DWORD m_MuzzleFlashTexture; //0x0024 
	DWORD m_FlashLightTexture; //0x0028 
	char m_szTextureName[64]; //0x1559888 
}; //Size=0x006C

void UpdateFlashLight(CFlashLightEffect *pFlashLight, const Vector &vecPos, const Vector &vecForward, const Vector &vecRight, const Vector &vecUp)
{
	// here we tell to the compiler wich calling convention we will use to call the function and the paramaters needed (note the __thiscall*)
	typedef void(__thiscall* UpdateLight_t)(void*, int, const Vector&, const Vector&, const Vector&, const Vector&, float, float, float, bool, const char*);

	static UpdateLight_t oUpdateLight = NULL;

	if (!oUpdateLight)
	{
		// here we have to deal with a call instruction (E8 rel32)
		DWORD callInstruction = Memory::Scan(cheat::main::clientdll, "E8 ? ? ? ? 8B 06 F3 0F 10 46"); // get the instruction address // CFlashlightEffect::UpdateLight
		DWORD relativeAddress = *(DWORD*)(callInstruction + 1); // read the rel32
		DWORD nextInstruction = callInstruction + 5; // get the address of next instruction
